## [DataFrame의 인덱스 다루기 - 1 ]
- 인덱스 종류 : 행 인덱스, 열 인덱스
- 특정 열을 행 인덱스 설정하는 방법
- 메서드 : df.set_index( 열 인덱스 , inplace=Flase)

In [2]:
# 모듈 로딩
import pandas as pd

In [3]:
# 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kore':[89,100,99],
       'eng':[70,80,90],
       'math':[99,88,77]}

In [6]:
# Dict --> DataFrame 형태로 저장
jumsudf=pd.DataFrame(jumsu)
jumsudf

   name  kore  eng  math
0   마징가    89   70    99
1   태권V   100   80    88
2  원더우먼    99   90    77

In [8]:
# name 컬럼을 행 인덱스로 설정
df2=jumsudf.set_index('name')
df2

      kore  eng  math
name
마징가     89   70    99
태권V    100   80    88
원더우먼    99   90    77

In [10]:
# df2 데이터프레임의 행 인덱스와 열 인덱스를 확인
print(df2.index, df2.columns, sep='\n')

Index(['마징가', '태권V', '원더우먼'], dtype='object', name='name')
Index(['kore', 'eng', 'math'], dtype='object')

In [18]:
# 데이터를 추출하기
# 마징가의 성적을 추출, 행추출 -> 변수명.loc[] / 변수명.iloc[]
# 여러개추출 변수명.[[이름,이름]], 변수명.[[0,1]]
df2.loc[['마징가', '원더우먼']]
df2.iloc[[0,2]]

      kore  eng  math
name
마징가     89   70    99
원더우먼    99   90    77

In [22]:
## 영어점수 컬럼을 인덱스로 만들기
df2.set_index(['eng'])

     kore  math
eng
70     89    99
80    100    88
90     99    77

In [30]:
# name, eng 컬럼을 행 인덱스 설정
df4=jumsudf.set_index(['name','eng'])
df4

          kore  math
name eng
마징가  70     89    99
태권V  80    100    88
원더우먼 90     99    77

In [31]:
# 멀티인덱스에서 행추출
df4.loc[('마징가', 70)]

kore    89
math    99
Name: (마징가, 70), dtype: int64